; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	instrument5 - instrument
	image4 - mode
	thermograph2 - mode
	thermograph0 - mode
	infrared5 - mode
	image3 - mode
	spectrograph1 - mode
	Star2 - direction
	Star4 - direction
	GroundStation0 - direction
	Star1 - direction
	Star6 - direction
	Star5 - direction
	Star3 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 image4)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared5)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star6)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph2)
	(supports instrument3 image3)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 Star1)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
	(supports instrument4 infrared5)
	(supports instrument4 thermograph2)
	(supports instrument4 image4)
	(calibration_target instrument4 Star3)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 Star5)
	(on_board instrument4 satellite4)
	(on_board instrument5 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star5)
)
(:goal (and
	(pointing satellite1 Star8)
	(pointing satellite2 Star3)
	(pointing satellite3 Star7)
	(have_image Star7 thermograph2)
	(have_image Star8 thermograph0)
	(have_image Star8 infrared5)
	(have_image Star9 image4)
	(have_image Star9 image3)
	(have_image Star10 thermograph0)
	(have_image Phenomenon11 image3)
	(have_image Phenomenon11 thermograph0)
	(have_image Phenomenon12 thermograph0)
	(have_image Phenomenon12 thermograph2)
))

)

; plan
1. (turn_to satellite3 star1 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 star1)
   goals met: 0 of 13
2. (switch_on instrument3 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument3)
   goals met: 0 of 13
3. (calibrate satellite3 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 0 of 13
4. (turn_to satellite3 phenomenon11 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 phenomenon11)
   goals met: 0 of 13
5. (turn_to satellite1 groundstation0 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 13
6. (take_image satellite3 phenomenon11 instrument3 image3)
   added: (have_image phenomenon11 image3)
   goals met: 1 of 13
7. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 13
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 13
9. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 1 of 13
10. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 1 of 13
11. (turn_to satellite0 star9 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star9)
   goals met: 1 of 13
12. (take_image satellite0 star9 instrument0 image4)
   added: (have_image star9 image4)
   goals met: 2 of 13
13. (turn_to satellite1 phenomenon11 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 13
14. (take_image satellite1 phenomenon11 instrument1 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 3 of 13
15. (turn_to satellite1 phenomenon12 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 13
16. (take_image satellite1 phenomenon12 instrument1 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 4 of 13
17. (turn_to satellite1 star10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star10)
   goals met: 4 of 13
18. (take_image satellite1 star10 instrument1 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 5 of 13
19. (turn_to satellite1 star8 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star8)
   goals met: 6 of 13
20. (take_image satellite1 star8 instrument1 infrared5)
   added: (have_image star8 infrared5)
   goals met: 7 of 13
21. (take_image satellite1 star8 instrument1 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 8 of 13
22. (turn_to satellite2 star3 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star3)
   goals met: 9 of 13
23. (turn_to satellite3 phenomenon12 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 phenomenon12)
   goals met: 9 of 13
24. (take_image satellite3 phenomenon12 instrument3 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 10 of 13
25. (turn_to satellite3 star9 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 star9)
   goals met: 10 of 13
26. (take_image satellite3 star9 instrument3 image3)
   added: (have_image star9 image3)
   goals met: 11 of 13
27. (turn_to satellite3 star7 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 star7)
   goals met: 12 of 13
28. (take_image satellite3 star7 instrument3 thermograph2)
   added: (have_image star7 thermograph2)
   goals met: 13 of 13
